
## Plan Result (aat)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 1 to change, 1 to destroy.</code></pre>

* Update
  * module.et-frontend-session-storage.azurerm_redis_cache.redis
* Replace
  * azurerm_key_vault_secret.redis_access_key


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.redis_access_key must be replaced
-/+ resource "azurerm_key_vault_secret" "redis_access_key" {
      ~ id                      = "https://et-aat.vault.azure.net/secrets/et-syr-redis-access-key/1034e35d354344d1a69abd4d7bd3fb57" -> (known after apply)
      ~ name                    = "et-syr-redis-access-key" -> "et-syr-redis-key" # forces replacement
      ~ resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-aat/providers/Microsoft.KeyVault/vaults/et-aat/secrets/et-syr-redis-access-key/versions/1034e35d354344d1a69abd4d7bd3fb57" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-aat/providers/Microsoft.KeyVault/vaults/et-aat/secrets/et-syr-redis-access-key" -> (known after apply)
      - tags                    = {} -> null
      ~ version                 = "1034e35d354344d1a69abd4d7bd3fb57" -> (known after apply)
      ~ versionless_id          = "https://et-aat.vault.azure.net/secrets/et-syr-redis-access-key" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.et-frontend-session-storage.azurerm_redis_cache.redis will be updated in-place
  ~ resource "azurerm_redis_cache" "redis" {
        id                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-syr-session-storage-cache-aat/providers/Microsoft.Cache/redis/et-syr-session-storage-aat"
        name                          = "et-syr-session-storage-aat"
        tags                          = {
            "application"         = "employment-tribunals"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/et-syr-frontend.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#et-developers"
            "environment"         = "staging"
            "managedBy"           = "Employment Tribunals"
        }
        # (24 unchanged attributes hidden)

      ~ redis_configuration {
          ~ maxfragmentationmemory_reserved         = 125 -> 642
          ~ maxmemory_delta                         = 125 -> 642
          ~ maxmemory_reserved                      = 125 -> 642
            # (15 unchanged attributes hidden)
        }
    }

Plan: 1 to add, 1 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":139,"Program":"tfcmt","SHA1":"","Target":"aat","Vars":{}} -->